# vstGetEventInfo

## Description
Gets the VS Tool Event Parameters.

```pascal
PROCEDURE vstGetEventInfo(
				VAR outAction   : LONGINT;
				VAR outMessage1 : LONGINT;
				VAR outMessage2 : LONGINT);
```

```python

def vs.vstGetEventInfo():
    return (outAction, outMessage1, outMessage2)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outAction|LONGINT||
|outMessage1|LONGINT||
|outMessage2|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events